Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
    // System commands ($H, $X, etc.)
    if (cmd[0] == '$') {
        if (cmd[1] == 'H' && (cmd[2] == '\0' || cmd[2] == '\n' || cmd[2] == '\r')) {
            // $H - Home all axes command
            ev->type = GCODE_EVENT_HOMING;
            ev->data.homing.axes_mask = 0x0F; // Home all axes (XYZA = bits 0-3)
            return true;
        }
    }
    
    return false;
}

/* -------------------------------------------------------------------------- */
/* Public Event Retrieval                                                     */
/* -------------------------------------------------------------------------- */
bool GCODE_GetNextEvent(GCODE_CommandQueue* cmdQueue, GCODE_Event* event)
{
    if (!cmdQueue || !event) return false;
    if (cmdQueue->count == 0) return false;

    GCODE_Command* gc = &cmdQueue->commands[cmdQueue->tail];
    if (gc->command[0] == '\0') {
        // Empty command - consume it and return false
        cmdQueue->tail = (cmdQueue->tail + 1) % GCODE_MAX_COMMANDS;
        cmdQueue->count--;
        return false;
    }

    if (!parse_command_to_event(gc->command, event)) {
        // Parse failed - consume command and return false
        DEBUG_PRINT_GCODE("[GetEvent] Parse failed for: '%s'\r\n", gc->command);
        cmdQueue->tail = (cmdQueue->tail + 1) % GCODE_MAX_COMMANDS;
        cmdQueue->count--;
        return false;
    }

    // ✅ SUCCESS: Event parsed, but DON'T consume yet!
    // Event will be consumed after successful processing via GCODE_ConsumeEvent()
    DEBUG_PRINT_GCODE("[GetEvent] Event ready: type=%d from cmd='%s'\r\n", event->type, gc->command);
    return true;
}

/**
 * @brief Consume the current event from the queue after successful processing
 * 
 * CRITICAL: Only call this AFTER successfully processing the event from GCODE_GetNextEvent!
 */
void GCODE_ConsumeEvent(GCODE_CommandQueue* cmdQueue)
{
    if (!cmdQueue) return;
    if (cmdQueue->count == 0) return;
    
    // Remove the event that was just processed
    cmdQueue->tail = (cmdQueue->tail + 1) % GCODE_MAX_COMMANDS;
    cmdQueue->count--;
}

/* -------------------------------------------------------------------------- */
/* Flow Control Helpers - Centralized OK Management                           */
/* -------------------------------------------------------------------------- */

/**
 * @brief Check if we should send a deferred "ok" response
 *
 * Two-phase release strategy:
 *
 * Phase A — gcode queue still has commands (q->count > 0):
 *   Release ONE deferred ok each time the gcode queue count DECREASES (a
 *   command was consumed and dispatched to the trajectory planner).
 *   prev_count ensures exactly one ok per consumed slot regardless of how
 *   many times this function is called per iteration.
 *
 * Phase B — gcode queue fully drained (q->count == 0):
 *   Hold ALL remaining deferred oks until physical motion is completely done:
 *     - trajectory queue empty  (motionQueueCount == 0)
 *     - arc generation finished (arcGenState == ARC_GEN_IDLE)
 *   Then flush every remaining pending ok in one burst.
 *
 * This guarantees UGS cannot receive its final ok(s) while stepper motion
 * is still executing, regardless of how many trajectory segments an arc or
 * a dense section of linear moves generates.
 */
void GCODE_CheckDeferredOk(APP_DATA* appData, GCODE_CommandQueue* q) {
    // Do NOT release deferred oks while a G4 dwell is in progress.
    if (MOTION_IsDwellActive()) {
        DEBUG_PRINT_GCODE("[FLOW] Dwell active — suppressing deferred ok release\r\n");
        return;
    }

    if (!startupPrefillDone) {
        // Pre-fill phase: release all pending oks once queue reaches high-water.
        if (q->count >= GCODE_QUEUE_HIGH_WATER) {
            startupPrefillDone = true;
            while (okPendingCount > 0) {
                if (UART_SendOK()) okPendingCount--;
                else break;
            }
        }
        return;
    }

    if (okPendingCount == 0) return;

    static uint32_t prev_count = 0;
    uint32_t curr = q->count;

    if (curr > 0) {
        // Phase A: gcode queue not yet empty — trickle one ok per consumed slot.
        if (curr < prev_count) {
            DEBUG_PRINT_GCODE("[DEFERRED-A] Slot freed (%lu->%lu), sending ok (pending=%lu)\r\n",
                              (unsigned long)prev_count, (unsigned long)curr,
                              (unsigned long)okPendingCount);
            if (UART_SendOK()) okPendingCount--;
        }
        prev_count = curr;
    } else {
        // Phase B: gcode queue at zero — wait for motion to fully complete.
        prev_count = 0;
        bool arc_idle  = (appData->arcGenState == ARC_GEN_IDLE);
        bool traj_idle = (appData->motionQueueCount == 0);
        if (arc_idle && traj_idle) {
            DEBUG_PRINT_GCODE("[DEFERRED-B] Motion done — flushing %lu pending oks\r\n",
                              (unsigned long)okPendingCount);
            while (okPendingCount > 0) {
                if (UART_SendOK()) okPendingCount--;
                else break;
            }
        }
    }
}

/**
 * @brief Decide whether to send "ok" immediately or defer it
 *
 * Gates purely on gcode command queue depth:
 *   >= HIGH_WATER → defer (stop filling UGS send window)
 *   <  HIGH_WATER → send immediately (keep UGS pushing commands)
 *
 * The trajectory planner queue is managed independently (MOTION_Arc backs
 * off at 62/64) — it does NOT gate UGS flow here.
 */
static void SendOrDeferOk(APP_DATA* appData, GCODE_CommandQueue* q)
{
    // While a G4 dwell is active, always defer.
    if (MOTION_IsDwellActive()) {
        DEBUG_PRINT_GCODE("[FLOW] Dwell active — deferring ok\r\n");
        okPendingCount++;
        return;
    }

    if (!startupPrefillDone) {
        // Pre-fill: send immediately so UGS keeps pushing and queue fills fast.
        (void)UART_SendOK();
        return;
    }

    // Normal flow: gate on gcode queue depth.
    if (q->count >= GCODE_QUEUE_HIGH_WATER) {
        DEBUG_PRINT_GCODE("[FLOW] Deferring ok (gcodeQ=%lu >= HIGH=%d, pending=%lu)\r\n",
                          (unsigned long)q->count, GCODE_QUEUE_HIGH_WATER,
                          (unsigned long)(okPendingCount + 1));
        okPendingCount++;
    } else {
        DEBUG_PRINT_GCODE("[FLOW] Sending immediate ok (gcodeQ=%lu < HIGH=%d)\r\n",
                          (unsigned long)q->count, GCODE_QUEUE_HIGH_WATER);
        (void)UART_SendOK();
    }
}

